WITH ИНТ AS (
SELECT НОМЕР_СТУДЕНТА,ДАТА,LEAD(ДАТА,1) OVER (PARTITION BY НОМЕР_СТУДЕНТА ORDER BY ДАТА),LEAD(ДАТА,1) OVER (PARTITION BY НОМЕР_СТУДЕНТА ORDER BY ДАТА)- ДАТА ИНТЕРВАЛ--Шаг 1)разность в днях между каждыми экзаменами
FROM УСПЕВАЕМОСТЬ) 
SELECT ФАМИЛИЯ||' '||SUBSTR(ИМЯ,1,1)||'.'||SUBSTR(ФАМИЛИЯ,1,1) ФИО,NVL(TO_CHAR(TRUNC(AVG(ИНТЕРВАЛ))),'-') "Средний инт-л м/у сдачами"--Шаг 2)
FROM ИНТ RIGHT JOIN СТУДЕНТЫ USING(НОМЕР_СТУДЕНТА)
GROUP BY НОМЕР_СТУДЕНТА,ФАМИЛИЯ||' '||SUBSTR(ИМЯ,1,1)||'.'||SUBSTR(ФАМИЛИЯ,1,1);
